{
	"dishes": [
		{
			"id": "1",
			"name": "Greek Salad",
			"source": "Food Network (two different recipes)",
			"preptime": 0,
			"waittime": 0,
			"cooktime": 0,
			"servings": 4,
			"comments": "Dried oregano can also be substituted for the fresh in the salad mix.  Only use 1\/2-1 teaspoon of the dried.",
			"calories": 3057,
			"fat": 297,
			"satfat": 63,
			"carbs": 78,
			"fiber": 23,
			"sugar": 34,
			"protein": 42,
			"instructions": "In a small bowl, whisk together the lemon juice, garlic, salt, and oil. Set aside.   In a large bowl lightly toss the lettuce with the olives, cheese, cucumber, tomatoes, onion, oregano, and black pepper. Let sit up to 2 hours.  To serve, toss salad with dressing and place sliced chicken on top.",
			"ingredients": [
				"6 tablespoon lemon juice\r",
				"2 clove garlic, minced\r",
				"2 teaspoon kosher salt, plus more to taste\r",
				"1 cup extra-virgin olive oil, preferably Greek\r",
				"<hr>\r",
				"1 head romaine lettuce, trimmed of tough stems and torn into bite-sized pieces\r",
				"1 cup kalamata olives, about 6oz\/cup\r",
				"1\/2 pound Feta cheese, crumbled\r",
				"1 cucumber, trimmed, cut into 1 inch chunks\r",
				"1 1\/2 cup grape tomatoes, halved\r",
				"1 small red onion, cut into 1\/2-inch wedges, soaked in cold water for 5 minutes and drained\r",
				"2 teaspoon dried oregano\r",
				"Freshly ground black pepper"
			],
			"tags": [
				"main",
				"greek",
				"salad",
				"dressing"
			]
		},

		{
			"id": "2",
			"name": "Spinach lasagna with mushroom ragu",
			"source": "Food Network Magazine Nov 2011",
			"preptime": 1800,
			"waittime": 900,
			"cooktime": 10920,
			"servings": 8,
			"comments": "",
			"calories": 0,
			"fat": 0,
			"satfat": 0,
			"carbs": 0,
			"fiber": 0,
			"sugar": 0,
			"protein": 0,
			"instructions": "1. Make the ragu: Soak the porcini mushrooms in 1 cup hot water until soft, about 15 minutes. Strain through a fine-mesh sieve over a bowl. Chop; reserve the liquid.\r\n\r\n2. Meanwhile, heat the olive oil in a pot over medium heat. Add the onion, carrot and celery and cook until soft, 5 minutes. Stir in the garlic and tomato paste and cook, stirring, 2 more minutes. Add the portobello and shiitake mushrooms, 1 teaspoon salt and 1\/2 teaspoon pepper; cook, stirring until the mushrooms are soft, 5 more minutes.\r\n\r\n3. Add the porcini mushrooms, cook 2 minutes. Add the reserved porcini liquid, bring to a boil and cook until reduced slightly, about 3 minutes. Add the tomatoes and their juice, 2 cups water and the bay leaves; bring to a boil, stirring occasionally. Reduce the heat to medium low, add the parsley and 1 teaspoon salt and simmer, stirring a few times, until thick, about 1 hour, 30 minutes. Discard the bay leaves. (you can make the ragu up to 1 day ahead; let cool, then cover and chill. Reheat before using.)\r\n\r\n4. Make the lasagna filling: Mix the parmesan, mozzarella and asiago; set 1 1\/2 cups of the cheese mixture aside. Combine the remaining cheese mixture in a large bowl with the ricotta, eggs, spinach, nutmeg and 1\/2 teaspoon salt.\r\n\r\n5. Preheat the oven to 375F. Bring a pot of water to a boil and add a generous amount of salt. Add the noodles and cook as the label directs. Drain and rinse under cold water; shake off the excess water.\r\n\r\n6. Spread 1 cup of the ragu in a 9-by-13-inch baking dish. Add a layer of noodles, then half of the spinach mixture and 2 cups ragu. Repeat with another layer of noodles, spinach mixture and ragu. Top with the remaining noodles and ragu and sprinkle with the reserved cheese. Cover with foil, place on a baking sheet and bake 50 minutes. Uncover and bake until golden, about 25 more minutes. Let rest before serving.",
			"ingredients": [
				"1 oz dried porcini mushrooms\r",
				"2 tbsp extra-virgin olive oil\r",
				"1 medium onion, chopped\r",
				"1 large carrot, finely chopped\r",
				"1 stalk celery, finely chopped\r",
				"4 clove garlic, chopped\r",
				"2 tbsp tomato paste\r",
				"2 portobello mushroom cap, chopped\r",
				"1 1\/2 lb shiitake mushrooms, stems removed, chopped\r",
				"Kosher salt and freshly ground pepper\r",
				"2 28oz cans whole San Marzano tomatoes, crushed by hand\r",
				"3 bay leaves\r",
				"1\/4 cup fresh parsley, chopped\r",
				"<hr>\r",
				"3 oz parmesan cheese, grated\r",
				"1 1\/2 lb part-skim mozzarella cheese, shredded\r",
				"8 oz asiago cheese, shredded\r",
				"2 lb ricotta cheese\r",
				"2 large eggs, lightly beaten\r",
				"1 lb frozen chopped spinach, thawed and squeezed dry\r",
				"1\/4 tsp nutmeg, freshly grated\r",
				"12 oz dried lasagna noodles"
			],
			"tags": [
				"italian",
				"vegetarian",
				"main"
			]
		},

		{
			"id": "3",
			"name": "Cranberry almond muffins",
			"source": "Martha Stewart Living Nov 2011",
			"preptime": 1200,
			"waittime": 600,
			"cooktime": 1200,
			"servings": 16,
			"comments": "",
			"calories": 2096,
			"fat": 48,
			"satfat": 16,
			"carbs": 384,
			"fiber": 32,
			"sugar": 208,
			"protein": 64,
			"instructions": "1. Preheat oven to 350F. Line 16 cups of two 12-cup muffin tins with baking cups and lightly coat each with cooking spray.\r\n2. Whisk together sugar, flours, baking soda, and salt in a large bowl. Whisk together milk, yogurt, eggs, and orange zest and juice in a medium bowl. Fold milk mixture into flour mixture, then gently fold in cranberries until combined.\r\n3. Spoon batter into baking cups until each is three-quarters full. Sprinkle with almonds. Bake until a toothpick inserted into the center of each comes out clean, about 20 minutes. Transfer pans to wire racks, and let cool for 10 minutes. Turn out muffins onto racks and let cool completely.",
			"ingredients": [
				"Vegetable oil cooking spray\r",
				"1 1\/4 cup sugar\r",
				"1 cup whole-wheat flour\r",
				"3\/4 cup all-purpose flour\r",
				"3\/4 cup almond flour\r",
				"1 tsp baking soda\r",
				"1\/4 tsp salt\r",
				"2\/3 cup nonfat milk\r",
				"2\/3 cup plain low-fat yogurt\r",
				"2 large eggs\r",
				"1 orange, zested and juiced\r",
				"1 cup cranberries, fresh or frozen\r",
				"1\/2 cup sliced almonds"
			],
			"tags": [
				"muffins",
				"breakfast",
				"untried"
			]
		},

		{
			"id": "4",
			"name": "French onion soup",
			"source": "http:\/\/www.marthastewart.com\/340253\/french-onion-soup?center=0&gallery=274637&slide=262463",
			"preptime": 900,
			"waittime": 0,
			"cooktime": 5400,
			"servings": 4,
			"calories": 0,
			"fat": 0,
			"satfat": 0,
			"carbs": 0,
			"fiber": 0,
			"sugar": 0,
			"protein": 0,
			"instructions": "Melt butter in a large Dutch oven or heavy pot on medium-low heat. Add onions. Spread them out in as thin a layer as possible. Sprinkle with sugar, and cook, stirring just as needed to keep onions from sticking, until they are melting and soft, golden brown, and beginning to caramelize, about 1 hour. (If doing 2 servings, cook for only 30-40 minutes.)\r\n\r\nSprinkle flour over onions, and stir to coat. Add sherry, stock, and thyme, and bring to a simmer. Cook, partially covered, for about 30 minutes, to allow the flavors to combine. Season with salt and pepper to taste.  (If doing 2 servings, cook for only 15 minutes.)\r\n\r\nMeanwhile, lightly toast bread under a broiler; set aside. Ladle hot soup into six ovenproof bowls. Arrange the bowls on a baking pan. Place 1 or 2 slices of toasted bread over each bowl of soup. Sprinkle 1\/2 cup grated cheese over bread in each bowl, and place under the broiler until cheese is melted and crusty brown around the edges. Watch carefully that bread doesn't burn.  \r\n\r\n(If you don't have broiler-proof bowls, instead lightly toast the bread, then top with the cheese and broil until bubbly and browned, 4-5 minutes. Serve the soup in an ordinary bowl, topped with the bread slices.)\r\n\r\nServe immediately.",
			"ingredients": [
				"4 tablespoon unsalted butter\r",
				"2 pound yellow onions, sliced 1\/4-inch into half circles\r",
				"1 teaspoon sugar\r",
				"1 tablespoon all-purpose flour\r",
				"1\/2 cup dry sherry\r",
				"2 teaspoon fresh thyme, chopped or 3\/4 teaspoon dried thyme\r",
				"Salt and freshly ground black pepper\r",
				"1 small French baguette, sliced crosswise into 1\/2-inch pieces\r",
				"8 ounce Gruyere cheese, grated on the large holes of a box grater (about 3 cups)"
			],
			"tags": [
				"soup",
				"main"
			]
		},

		{
			"id": "5",
			"name": "Easy chickpea and vegetable curry",
			"source": "Vegetarian Table by Pampered Chef",
			"preptime": 1200,
			"waittime": 0,
			"cooktime": 1200,
			"servings": 6,
			"comments": "",
			"calories": 2736,
			"fat": 102,
			"satfat": 48,
			"carbs": 432,
			"fiber": 66,
			"sugar": 48,
			"protein": 66,
			"instructions": "Cook the rice.\r\n\r\nHeat oil in a large saucepan over medium heat. Add onion and serrano; cook 3-4 minutes or until onion is softened. \r\n\r\nAdd potato, chickpeas, curry powder, garlic, and ginger. Cook and stir 3-4 minutes or until fragrant. \r\n\r\nStir in coconut milk and bring to a simmer. Reduce heat to medium low; cover and cook 8-9 minutes or until potato is tender, stirring frequently.\r\n\r\nAdd cauliflower, juice, peas, and salt to pan; simmer 4-5 minutes or until cauliflower is tender. Serve curry with rice.",
			"ingredients": [
				"1 cup uncooked basmati rice\r",
				"1 medium onion, chopped\r",
				"1 serrano pepper, chopped\r",
				"1 small sweet potato, peeled and diced small\r",
				"2 tbsp olive oil\r",
				"2 can chickpeas, drained and rinsed\r",
				"3 tbsp curry powder\r",
				"4 garlic cloves, pressed\r",
				"1 1\/2 tbsp ginger\r",
				"2 can lite coconut milk\r",
				"1\/2 medium head cauliflower, cut into about 2 cups small florets\r",
				"2 tbsp lemon juice\r",
				"1 cup frozen peas\r",
				"1 3\/4 tsp salt"
			],
			"tags": [
				"indian",
				"vegetarian",
				"main"
			]
		}
	]
}